"use client";

import { useState } from "react";
import "./Faq.css";

const faqItems = [
  {
    id: 1,
    question: "Що потрібно для початку співпраці?",
    answer:
      "Звернутись за телефоном +38 (066) 68 998 57 і/або заповнити бриф нового клієнта для розуміння вашого бізнесу та цілей. Далі ми беремо процес на себе.",
  },
  {
    id: 2,
    question:
      "Я можу замовити тільки пакет послуг по контракту на 3/6/12 міс.?",
    answer:
      "Ні. Ми також працюємо з окремими задачами, якщо у вас є чітка бренд-стратегія або план маркетингових дій. Можемо реалізувати: логотип, айдентику та фірмовий стиль, брендбук і гайдлайни, слоган, презентації компанії чи продукту, дизайн упакування, Instagram-стратегію, 2D/3D анімацію, моушн-дизайн, ілюстрації, корпоративного персонажа, дизайн комерційних просторів, іміджеву та рекламну зйомку.",
  },
  {
    id: 3,
    question: "Ми можемо працювати, якщо у мене немає маркетингової команди?",
    answer:
      "Так. Ми можемо повністю закрити брендинг і стратегію або працювати як ваша зовнішня команда.",
  },
  {
    id: 4,
    question: "Чи можу я записатись на консультацію?",
    answer:
      "Так. Ми проводимо інструктажі з побудови бренду та стратегічні консультації для власників бізнесу й маркетингових команд. Наші фахівці можуть проконсультувати з бренд-стратегії, айдентики, фірмового стилю, комунікацій або провести бренд-сесію для вашого самостійного створення бренд-стратегії.",
  },
  {
    id: 5,
    question:
      "Якщо наразі тільки маю бізнес-ідею, а не працюючий бізнес, що ви можете запропонувати?",
    answer:
      "Ми дуже рекомендуємо почати з консультації та пройти бренд-інструктаж від нашої команди. Тоді одразу стане ясно, чи готові ми разом рухатися у бік створення бренд-системи чи варто ще підготуватися і повернутися до BOZABRAND пізніше.",
  },
  {
    id: 6,
    question: "Чи є категорії клієнтів, з якими ви не працюєте?",
    answer:
      "Так. Ми не беремо проєкти без чітких цілей, відкритості до змін і довгострокового мислення. Ми не співпрацюємо з компаніями, засновниками або бенефіціарами яких є резиденти країни-агресора, а також з нішами, що вводять споживачів в оману або порушують етичні норми: казино, беттинг, фінансові піраміди, псевдоінвестиційні проєкти, шахрайські сервіси, маніпулятивні інфобізнеси, продукти з недоведеною цінністю чи обіцянками гарантованого результату.",
  },
];

export function Faq() {
  const [openId, setOpenId] = useState(1);

  // eslint-disable-next-line @typescript-eslint/no-explicit-any
  const toggleItem = (id: any) => {
    setOpenId(openId === id ? null : id);
  };

  return (
    <section className="faq">
      <div className="container">
        <div className="faq-top">
          <h2 className="faq-top-title">FAQ</h2>
        </div>

        <div className="faq-accordeon">
          {faqItems.map((item) => {
            const isOpen = openId === item.id;

            return (
              <div className="faq-accordeon-item" key={item.id}>
                <div
                  className="faq-accordeon-item-top"
                  onClick={() => toggleItem(item.id)}
                >
                  <div className="faq-accordeon-item-top-left">
                    <p>[{String(item.id).padStart(2, "0")}]</p>
                    <h2>{item.question}</h2>
                  </div>

                  <button
                    type="button"
                    className={`faq-accordeon-icon ${isOpen ? "active" : ""}`}
                    aria-label={
                      isOpen ? "Закрити відповідь" : "Відкрити відповідь"
                    }
                  />
                </div>

                <div
                  className={`faq-accordeon-item-content ${isOpen ? "open" : ""}`}
                >
                  <div className="faq-accordeon-item-content-inner">
                    <div className="faq-accordeon-item-content-body">
                      <p>{item.answer}</p>
                    </div>
                  </div>
                </div>
              </div>
            );
          })}
        </div>
      </div>
    </section>
  );
}
