import Image from "next/image";
import "./StackCards.css";

const ImgCards = [
  {
    bgImage: "/Method/StackCards/bg1.png",
    image: "/Method/StackCards/img1v2.png",
  },
  {
    bgImage: "/Method/StackCards/bg2.png",
    image: "/Method/StackCards/img2v2.png",
  },
  {
    bgImage: "/Method/StackCards/bg3.png",
    image: "/Method/StackCards/img3v2.png",
  },
  {
    bgImage: "/Method/StackCards/bg4.png",
    image: "/Method/StackCards/img4v2.png",
  },
  {
    bgImage: "/Method/StackCards/bg5.png",
    image: "/Method/StackCards/img5v2.png",
  },
  {
    bgImage: "/Method/StackCards/bg6.png",
    image: "/Method/StackCards/img6v2.png",
  },
];

const textCards = [
  {
    title: "РЕГУЛЮЄМО ЗВУК",
    sections: [
      {
        title: "РОЗРОБКА РЕКЛАМНОЇ КАМПАНІЇ",
        list: [
          "Розробляємо центральну ідею",
          "Масштабуємо ідею на обрані формати комунікації",
          "Запускаємо таргетовану рекламу",
          "Працюємо з лідерами думок",
          "Контролюємо хід проведення рекламної кампанії",
          "Аналізуємо KPI",
        ],
      },
      {
        title: "РЕЗУЛЬТАТ",
        list: [
          "Креативи у необхідних форматах",
          "Сценарії роликів",
          "Центральний візуал, активації",
          "Банери",
          "Презентація компанії",
          "Презентація продукту",
          "Анімація 2d/3d",
          "Ілюстрація",
          "Аналітичний звіт за результатами рекламної кампанії",
        ],
      },
    ],
  },
  {
    title: "ДАЄМО ДИХАННЯ",
    sections: [
      {
        title: "РОЗРОБКА ПЛАНУ ТА СУПРОВІД ЗАПУСКУ",
        list: [
          "Розробляємо ідею кампанії",
          "Проводимо інструктаж усіх підрядників проєкту",
          "Створюємо контент з новою ідеєю бренду",
          "Розробляємо сайт",
          "Розробляємо стратегію ведення та контент для сторінок Instagram, Facebook, LinkedIn",
          "Запускаємо таргетовану рекламу",
          "Працюємо з лідерами думок",
          "Аналізуємо KPI",
        ],
      },
      {
        title: "РЕЗУЛЬТАТ",
        list: [
          "Контент-план знайомства аудиторії з брендом",
          "Креативи для обраних каналів комунікації — первинне знайомство потенційних споживачів з брендом",
          "Макети рекламної продукції та мерчу, готові до запуску",
          "Іміджеве фото",
          "Фото та відео, креативи для обраних каналів комунікації",
          "Сайт",
          "Презентація компанії",
          "Презентація продукту",
          "Анімація 2d/3d",
          "Ілюстрація",
          "Аналітичний звіт за результатами запуску",
        ],
      },
    ],
  },
  {
    title: "НАЛАШТОВУЄМО ЗВУК",
    sections: [
      {
        title: "РОЗРОБКА СТРАТЕГІЇ КОМУНІКАЦІЇ",
        list: [
          "Проводимо дослідження споживацьких настроїв для різних сегментів споживачів",
          "Розробляємо креативну ідею комунікації в обраних каналах",
          "Формуємо медіа-план",
          "Контролюємо хід проведення комунікаційної кампанії",
          "Аналізуємо KPI",
        ],
      },
      {
        title: "РЕЗУЛЬТАТ",
        list: [
          "Медіа-план з вимірюванням метрик та конкретними креативами",
          "Готовий контент для обраних каналів комунікації",
          "Макети рекламної продукції та мерчу, готові до запуску",
          "Креативи для обраних каналів комунікації",
          "Іміджева фотозйомка",
          "Рекламні відеоролики",
          "Презентація компанії",
          "Презентація продукту",
          "Анімація 2d/3d",
          "Ілюстрація",
        ],
      },
    ],
  },
  {
    title: "ДЕТАЛІЗУЄМО ПОГЛЯД",
    sections: [
      {
        title: "РОЗРОБКА ФІРМОВОГО СТИЛЮ",
        list: [
          "Розробляємо макети конкретної фірмової продукції, сувенірів, мерчу",
          "Залишаємося на зв’язку з підрядниками-виробниками",
          "Готуємо файли до виробництва",
          "Контролюємо процес виробництва",
        ],
      },
      {
        title: "РЕЗУЛЬТАТ",
        list: [
          "Макети рекламної продукції, мерчу, підготовлені до виробництва",
          "Гайдлайн",
          "Брендбук",
        ],
      },
    ],
  },
  {
    title: "ФОРМУЄМО ПОГЛЯД",
    sections: [
      {
        title: "РОЗРОБКА АЙДЕНТИКИ",
        list: [
          "Проводимо дизайн-сесію",
          "Створюємо персоналізовану карту настрою",
          "Розробляємо варіанти концепт-дизайну",
          "Створюємо фінальну презентацію айдентики",
        ],
      },
      {
        title: "РЕЗУЛЬТАТ",
        list: [
          "Метафоричний центральний візуальний образ бренду",
          "Логотип і всі можливі версії",
          "Шрифти, кольори, графіка",
          "Візуальні прийоми, композиція",
          "Приклади реалізації на носіях",
          "Ідеї ексклюзивного мерчу",
        ],
      },
    ],
  },
  {
    title: "ВСТАНОВЛЮЄМО РІВНОВАГУ",
    sections: [
      {
        title: "РОЗРОБКА СТРАТЕГІЇ БРЕНДУ",
        list: [
          "Проводимо освітній день для команди",
          "Знаходимо “серце” бренду на бренд-сесії",
          "Досліджуємо цільову аудиторію",
          "Проводимо глибинні опитування",
          "Вивчаємо категорію та конкурентів",
          "Формуємо центральну ідею бренду",
          "Створюємо корпоративного персонажа",
          "Створюємо цілісну бренд-платформу",
        ],
      },
      {
        title: "РЕЗУЛЬТАТ",
        list: [
          "Місія",
          "Цінності",
          "Позиціонування",
          "Цільова людина",
          "Повідомлення",
          "Унікальність",
          "Характер: мова, вайб, музика, образ",
        ],
      },
    ],
  },
];

export function StackCards() {
  return (
    <section className="stack-cards-section">
      <div className="container">
        <h2 className="stack-cards-title">
          проводимо інструктажі СЕО і команд
        </h2>

        <div className="stack-cards">
          <div className="stack-cards-text-blocks">
            {textCards.map((card, i) => (
              <div className="stack-cards-text-block" key={i}>
                <h2>{card.title}</h2>

                <div className="stack-cards-text-block-content">
                  {card.sections.map((section, index) => (
                    <div
                      className="stack-cards-text-block-content-card"
                      key={index}
                    >
                      <h3>{section.title}</h3>

                      <ul className="stack-cards-text-block-content-card-list">
                        {section.list.map((item, itemIndex) => (
                          <li key={itemIndex}>{item}</li>
                        ))}
                      </ul>
                    </div>
                  ))}
                </div>
              </div>
            ))}
          </div>

          <div className="stack-cards-img-blocks">
            {ImgCards.map((img, i) => (
              <div
                className="stack-cards-img-block"
                style={{ backgroundImage: `url(${img.bgImage})` }}
                key={i}
              >
                <Image
                  src={img.image}
                  width={500}
                  height={500}
                  alt={`card-${i + 1}`}
                />
              </div>
            ))}
          </div>
        </div>
      </div>
    </section>
  );
}
